Microchip-MPLAB-Harmony/csp/apps/trng/random_number/firmware/src/packs/ATSAME54P20A_DFP/component/etm.h
/**
 * \brief Component description for ETM
 *
 * © 2018 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2018-12-05T04:45:25Z */
#ifndef _SAME54_ETM_COMPONENT_H_
#define _SAME54_ETM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ETM                                          */
/* ************************************************************************** */

/* -------- ETM_CR : (ETM Offset: 0x00) (R/W 32) ETM Main Control Register -------- */
#define ETM_CR_RESETVALUE                   _U_(0x411)                                    /**<  (ETM_CR) ETM Main Control Register  Reset Value */

#define ETM_CR_ETMPD_Pos                      _U_(0)                                         /**< (ETM_CR) ETM Power Down Position */
#define ETM_CR_ETMPD_Msk                      (_U_(0x1) << ETM_CR_ETMPD_Pos)                 /**< (ETM_CR) ETM Power Down Mask */
#define ETM_CR_PORTSIZE_Pos                   _U_(4)                                         /**< (ETM_CR) Port Size bits 2:0 Position */
#define ETM_CR_PORTSIZE_Msk                   (_U_(0x7) << ETM_CR_PORTSIZE_Pos)              /**< (ETM_CR) Port Size bits 2:0 Mask */
#define ETM_CR_PORTSIZE(value)                (ETM_CR_PORTSIZE_Msk & ((value) << ETM_CR_PORTSIZE_Pos))
#define ETM_CR_STALL_Pos                      _U_(7)                                         /**< (ETM_CR) Stall Processor Position */
#define ETM_CR_STALL_Msk                      (_U_(0x1) << ETM_CR_STALL_Pos)                 /**< (ETM_CR) Stall Processor Mask */
#define ETM_CR_BROUT_Pos                      _U_(8)                                         /**< (ETM_CR) Branch Output Position */
#define ETM_CR_BROUT_Msk                      (_U_(0x1) << ETM_CR_BROUT_Pos)                 /**< (ETM_CR) Branch Output Mask */
#define ETM_CR_DBGRQ_Pos                      _U_(9)                                         /**< (ETM_CR) Debug Request Control Position */
#define ETM_CR_DBGRQ_Msk                      (_U_(0x1) << ETM_CR_DBGRQ_Pos)                 /**< (ETM_CR) Debug Request Control Mask */
#define ETM_CR_PROG_Pos                       _U_(10)                                        /**< (ETM_CR) ETM Programming Position */
#define ETM_CR_PROG_Msk                       (_U_(0x1) << ETM_CR_PROG_Pos)                  /**< (ETM_CR) ETM Programming Mask */
#define ETM_CR_PORTSEL_Pos                    _U_(11)                                        /**< (ETM_CR) ETM Port Select Position */
#define ETM_CR_PORTSEL_Msk                    (_U_(0x1) << ETM_CR_PORTSEL_Pos)               /**< (ETM_CR) ETM Port Select Mask */
#define ETM_CR_PORTMODE2_Pos                  _U_(13)                                        /**< (ETM_CR) Port Mode bit 2 Position */
#define ETM_CR_PORTMODE2_Msk                  (_U_(0x1) << ETM_CR_PORTMODE2_Pos)             /**< (ETM_CR) Port Mode bit 2 Mask */
#define ETM_CR_PORTMODE_Pos                   _U_(16)                                        /**< (ETM_CR) Port Mode bits 1:0 Position */
#define ETM_CR_PORTMODE_Msk                   (_U_(0x3) << ETM_CR_PORTMODE_Pos)              /**< (ETM_CR) Port Mode bits 1:0 Mask */
#define ETM_CR_PORTMODE(value)                (ETM_CR_PORTMODE_Msk & ((value) << ETM_CR_PORTMODE_Pos))
#define ETM_CR_PORTSIZE3_Pos                  _U_(21)                                        /**< (ETM_CR) Port Size bit 3 Position */
#define ETM_CR_PORTSIZE3_Msk                  (_U_(0x1) << ETM_CR_PORTSIZE3_Pos)             /**< (ETM_CR) Port Size bit 3 Mask */
#define ETM_CR_TSEN_Pos                       _U_(28)                                        /**< (ETM_CR) TimeStamp Enable Position */
#define ETM_CR_TSEN_Msk                       (_U_(0x1) << ETM_CR_TSEN_Pos)                  /**< (ETM_CR) TimeStamp Enable Mask */
#define ETM_CR_Msk                            _U_(0x10232FF1)                                /**< (ETM_CR) Register Mask  */


/* -------- ETM_CCR : (ETM Offset: 0x04) ( R/ 32) ETM Configuration Code Register -------- */
#define ETM_CCR_RESETVALUE                  _U_(0x8C802000)                               /**<  (ETM_CCR) ETM Configuration Code Register  Reset Value */

#define ETM_CCR_Msk                           _U_(0x00000000)                                /**< (ETM_CCR) Register Mask  */


/* -------- ETM_TRIGGER : (ETM Offset: 0x08) (R/W 32) ETM Trigger Event Register -------- */
#define ETM_TRIGGER_Msk                       _U_(0x00000000)                                /**< (ETM_TRIGGER) Register Mask  */


/* -------- ETM_SR : (ETM Offset: 0x10) (R/W 32) ETM Status Register -------- */
#define ETM_SR_Msk                            _U_(0x00000000)                                /**< (ETM_SR) Register Mask  */


/* -------- ETM_SCR : (ETM Offset: 0x14) ( R/ 32) ETM System Configuration Register -------- */
#define ETM_SCR_RESETVALUE                  _U_(0x20D09)                                  /**<  (ETM_SCR) ETM System Configuration Register  Reset Value */

#define ETM_SCR_Msk                           _U_(0x00000000)                                /**< (ETM_SCR) Register Mask  */


/* -------- ETM_TEEVR : (ETM Offset: 0x20) (R/W 32) ETM TraceEnable Event Register -------- */
#define ETM_TEEVR_Msk                         _U_(0x00000000)                                /**< (ETM_TEEVR) Register Mask  */


/* -------- ETM_TECR1 : (ETM Offset: 0x24) (R/W 32) ETM TraceEnable Control 1 Register -------- */
#define ETM_TECR1_Msk                         _U_(0x00000000)                                /**< (ETM_TECR1) Register Mask  */


/* -------- ETM_FFLR : (ETM Offset: 0x28) (R/W 32) ETM FIFO Full Level Register -------- */
#define ETM_FFLR_Msk                          _U_(0x00000000)                                /**< (ETM_FFLR) Register Mask  */


/* -------- ETM_CNTRLDVR1 : (ETM Offset: 0x140) (R/W 32) ETM Free-running Counter Reload Value -------- */
#define ETM_CNTRLDVR1_Msk                     _U_(0x00000000)                                /**< (ETM_CNTRLDVR1) Register Mask  */


/* -------- ETM_SYNCFR : (ETM Offset: 0x1E0) ( R/ 32) ETM Synchronization Frequency Register -------- */
#define ETM_SYNCFR_RESETVALUE               _U_(0x400)                                    /**<  (ETM_SYNCFR) ETM Synchronization Frequency Register  Reset Value */

#define ETM_SYNCFR_Msk                        _U_(0x00000000)                                /**< (ETM_SYNCFR) Register Mask  */


/* -------- ETM_IDR : (ETM Offset: 0x1E4) ( R/ 32) ETM ID Register -------- */
#define ETM_IDR_RESETVALUE                  _U_(0x4114F250)                               /**<  (ETM_IDR) ETM ID Register  Reset Value */

#define ETM_IDR_Msk                           _U_(0x00000000)                                /**< (ETM_IDR) Register Mask  */


