Microchip-MPLAB-Harmony/csp/apps/trng/random_number/firmware/src/packs/ATSAME54P20A_DFP/component/etm.h
/* -------- ETM_CCER : (ETM Offset: 0x1E8) ( R/ 32) ETM Configuration Code Extension Register -------- */
#define ETM_CCER_RESETVALUE                 _U_(0x18541800)                               /**<  (ETM_CCER) ETM Configuration Code Extension Register  Reset Value */

#define ETM_CCER_Msk                          _U_(0x00000000)                                /**< (ETM_CCER) Register Mask  */


/* -------- ETM_TESSEICR : (ETM Offset: 0x1F0) (R/W 32) ETM TraceEnable Start/Stop EmbeddedICE Control Register -------- */
#define ETM_TESSEICR_Msk                      _U_(0x00000000)                                /**< (ETM_TESSEICR) Register Mask  */


/* -------- ETM_TSEVT : (ETM Offset: 0x1F8) (R/W 32) ETM TimeStamp Event Register -------- */
#define ETM_TSEVT_Msk                         _U_(0x00000000)                                /**< (ETM_TSEVT) Register Mask  */


/* -------- ETM_TRACEIDR : (ETM Offset: 0x200) (R/W 32) ETM CoreSight Trace ID Register -------- */
#define ETM_TRACEIDR_RESETVALUE             _U_(0x00)                                     /**<  (ETM_TRACEIDR) ETM CoreSight Trace ID Register  Reset Value */

#define ETM_TRACEIDR_Msk                      _U_(0x00000000)                                /**< (ETM_TRACEIDR) Register Mask  */


/* -------- ETM_IDR2 : (ETM Offset: 0x208) ( R/ 32) ETM ID Register 2 -------- */
#define ETM_IDR2_RESETVALUE                 _U_(0x00)                                     /**<  (ETM_IDR2) ETM ID Register 2  Reset Value */

#define ETM_IDR2_Msk                          _U_(0x00000000)                                /**< (ETM_IDR2) Register Mask  */


/* -------- ETM_PDSR : (ETM Offset: 0x314) ( R/ 32) ETM Device Power-Down Status Register -------- */
#define ETM_PDSR_RESETVALUE                 _U_(0x01)                                     /**<  (ETM_PDSR) ETM Device Power-Down Status Register  Reset Value */

#define ETM_PDSR_Msk                          _U_(0x00000000)                                /**< (ETM_PDSR) Register Mask  */


/* -------- ETM_ITMISCIN : (ETM Offset: 0xEE0) ( R/ 32) ETM Integration Test Miscellaneous Inputs -------- */
#define ETM_ITMISCIN_Msk                      _U_(0x00000000)                                /**< (ETM_ITMISCIN) Register Mask  */


/* -------- ETM_ITTRIGOUT : (ETM Offset: 0xEE8) ( /W 32) ETM Integration Test Trigger Out -------- */
#define ETM_ITTRIGOUT_Msk                     _U_(0x00000000)                                /**< (ETM_ITTRIGOUT) Register Mask  */


/* -------- ETM_ITATBCTR2 : (ETM Offset: 0xEF0) ( R/ 32) ETM Integration Test ATB Control 2 -------- */
#define ETM_ITATBCTR2_Msk                     _U_(0x00000000)                                /**< (ETM_ITATBCTR2) Register Mask  */


/* -------- ETM_ITATBCTR0 : (ETM Offset: 0xEF8) ( /W 32) ETM Integration Test ATB Control 0 -------- */
#define ETM_ITATBCTR0_Msk                     _U_(0x00000000)                                /**< (ETM_ITATBCTR0) Register Mask  */


/* -------- ETM_ITCTRL : (ETM Offset: 0xF00) (R/W 32) ETM Integration Mode Control Register -------- */
#define ETM_ITCTRL_RESETVALUE               _U_(0x00)                                     /**<  (ETM_ITCTRL) ETM Integration Mode Control Register  Reset Value */

#define ETM_ITCTRL_INTEGRATION_Pos            _U_(0)                                         /**< (ETM_ITCTRL)  Position */
#define ETM_ITCTRL_INTEGRATION_Msk            (_U_(0x1) << ETM_ITCTRL_INTEGRATION_Pos)       /**< (ETM_ITCTRL)  Mask */
#define ETM_ITCTRL_Msk                        _U_(0x00000001)                                /**< (ETM_ITCTRL) Register Mask  */


/* -------- ETM_CLAIMSET : (ETM Offset: 0xFA0) (R/W 32) ETM Claim Tag Set Register -------- */
#define ETM_CLAIMSET_Msk                      _U_(0x00000000)                                /**< (ETM_CLAIMSET) Register Mask  */


/* -------- ETM_CLAIMCLR : (ETM Offset: 0xFA4) (R/W 32) ETM Claim Tag Clear Register -------- */
#define ETM_CLAIMCLR_Msk                      _U_(0x00000000)                                /**< (ETM_CLAIMCLR) Register Mask  */


/* -------- ETM_LAR : (ETM Offset: 0xFB0) ( /W 32) ETM Lock Access Register -------- */
#define ETM_LAR_Msk                           _U_(0x00000000)                                /**< (ETM_LAR) Register Mask  */


/* -------- ETM_LSR : (ETM Offset: 0xFB4) ( R/ 32) ETM Lock Status Register -------- */
#define ETM_LSR_Present_Pos                   _U_(0)                                         /**< (ETM_LSR)  Position */
#define ETM_LSR_Present_Msk                   (_U_(0x1) << ETM_LSR_Present_Pos)              /**< (ETM_LSR)  Mask */
#define ETM_LSR_Access_Pos                    _U_(1)                                         /**< (ETM_LSR)  Position */
#define ETM_LSR_Access_Msk                    (_U_(0x1) << ETM_LSR_Access_Pos)               /**< (ETM_LSR)  Mask */
#define ETM_LSR_ByteAcc_Pos                   _U_(2)                                         /**< (ETM_LSR)  Position */
#define ETM_LSR_ByteAcc_Msk                   (_U_(0x1) << ETM_LSR_ByteAcc_Pos)              /**< (ETM_LSR)  Mask */
#define ETM_LSR_Msk                           _U_(0x00000007)                                /**< (ETM_LSR) Register Mask  */


/* -------- ETM_AUTHSTATUS : (ETM Offset: 0xFB8) ( R/ 32) ETM Authentication Status Register -------- */
#define ETM_AUTHSTATUS_Msk                    _U_(0x00000000)                                /**< (ETM_AUTHSTATUS) Register Mask  */


/* -------- ETM_DEVTYPE : (ETM Offset: 0xFCC) ( R/ 32) ETM CoreSight Device Type Register -------- */
#define ETM_DEVTYPE_RESETVALUE              _U_(0x13)                                     /**<  (ETM_DEVTYPE) ETM CoreSight Device Type Register  Reset Value */

#define ETM_DEVTYPE_Msk                       _U_(0x00000000)                                /**< (ETM_DEVTYPE) Register Mask  */


/* -------- ETM_PIDR4 : (ETM Offset: 0xFD0) ( R/ 32) ETM Peripheral Identification Register #4 -------- */
#define ETM_PIDR4_RESETVALUE                _U_(0x04)                                     /**<  (ETM_PIDR4) ETM Peripheral Identification Register #4  Reset Value */

#define ETM_PIDR4_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR4) Register Mask  */


/* -------- ETM_PIDR5 : (ETM Offset: 0xFD4) ( R/ 32) ETM Peripheral Identification Register #5 -------- */
#define ETM_PIDR5_RESETVALUE                _U_(0x00)                                     /**<  (ETM_PIDR5) ETM Peripheral Identification Register #5  Reset Value */

#define ETM_PIDR5_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR5) Register Mask  */


/* -------- ETM_PIDR6 : (ETM Offset: 0xFD8) ( R/ 32) ETM Peripheral Identification Register #6 -------- */
#define ETM_PIDR6_RESETVALUE                _U_(0x00)                                     /**<  (ETM_PIDR6) ETM Peripheral Identification Register #6  Reset Value */

#define ETM_PIDR6_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR6) Register Mask  */


/* -------- ETM_PIDR7 : (ETM Offset: 0xFDC) ( R/ 32) ETM Peripheral Identification Register #7 -------- */
#define ETM_PIDR7_RESETVALUE                _U_(0x00)                                     /**<  (ETM_PIDR7) ETM Peripheral Identification Register #7  Reset Value */

#define ETM_PIDR7_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR7) Register Mask  */


