Microchip-MPLAB-Harmony/csp/apps/trng/random_number/firmware/src/packs/ATSAME54P20A_DFP/component/etm.h
/* -------- ETM_PIDR0 : (ETM Offset: 0xFE0) ( R/ 32) ETM Peripheral Identification Register #0 -------- */
#define ETM_PIDR0_RESETVALUE                _U_(0x25)                                     /**<  (ETM_PIDR0) ETM Peripheral Identification Register #0  Reset Value */

#define ETM_PIDR0_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR0) Register Mask  */


/* -------- ETM_PIDR1 : (ETM Offset: 0xFE4) ( R/ 32) ETM Peripheral Identification Register #1 -------- */
#define ETM_PIDR1_RESETVALUE                _U_(0xB9)                                     /**<  (ETM_PIDR1) ETM Peripheral Identification Register #1  Reset Value */

#define ETM_PIDR1_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR1) Register Mask  */


/* -------- ETM_PIDR2 : (ETM Offset: 0xFE8) ( R/ 32) ETM Peripheral Identification Register #2 -------- */
#define ETM_PIDR2_RESETVALUE                _U_(0x0B)                                     /**<  (ETM_PIDR2) ETM Peripheral Identification Register #2  Reset Value */

#define ETM_PIDR2_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR2) Register Mask  */


/* -------- ETM_PIDR3 : (ETM Offset: 0xFEC) ( R/ 32) ETM Peripheral Identification Register #3 -------- */
#define ETM_PIDR3_RESETVALUE                _U_(0x00)                                     /**<  (ETM_PIDR3) ETM Peripheral Identification Register #3  Reset Value */

#define ETM_PIDR3_Msk                         _U_(0x00000000)                                /**< (ETM_PIDR3) Register Mask  */


/* -------- ETM_CIDR0 : (ETM Offset: 0xFF0) ( R/ 32) ETM Component  Identification Register #0 -------- */
#define ETM_CIDR0_RESETVALUE                _U_(0x0D)                                     /**<  (ETM_CIDR0) ETM Component  Identification Register #0  Reset Value */

#define ETM_CIDR0_Msk                         _U_(0x00000000)                                /**< (ETM_CIDR0) Register Mask  */


/* -------- ETM_CIDR1 : (ETM Offset: 0xFF4) ( R/ 32) ETM Component  Identification Register #1 -------- */
#define ETM_CIDR1_RESETVALUE                _U_(0x90)                                     /**<  (ETM_CIDR1) ETM Component  Identification Register #1  Reset Value */

#define ETM_CIDR1_Msk                         _U_(0x00000000)                                /**< (ETM_CIDR1) Register Mask  */


/* -------- ETM_CIDR2 : (ETM Offset: 0xFF8) ( R/ 32) ETM Component  Identification Register #2 -------- */
#define ETM_CIDR2_RESETVALUE                _U_(0x05)                                     /**<  (ETM_CIDR2) ETM Component  Identification Register #2  Reset Value */

#define ETM_CIDR2_Msk                         _U_(0x00000000)                                /**< (ETM_CIDR2) Register Mask  */


/* -------- ETM_CIDR3 : (ETM Offset: 0xFFC) ( R/ 32) ETM Component  Identification Register #3 -------- */
#define ETM_CIDR3_RESETVALUE                _U_(0xB1)                                     /**<  (ETM_CIDR3) ETM Component  Identification Register #3  Reset Value */

#define ETM_CIDR3_Msk                         _U_(0x00000000)                                /**< (ETM_CIDR3) Register Mask  */


/** \brief ETM register offsets definitions */
#define ETM_CR_REG_OFST                (0x00)         /**< (ETM_CR) ETM Main Control Register Offset */
#define ETM_CCR_REG_OFST               (0x04)         /**< (ETM_CCR) ETM Configuration Code Register Offset */
#define ETM_TRIGGER_REG_OFST           (0x08)         /**< (ETM_TRIGGER) ETM Trigger Event Register Offset */
#define ETM_SR_REG_OFST                (0x10)         /**< (ETM_SR) ETM Status Register Offset */
#define ETM_SCR_REG_OFST               (0x14)         /**< (ETM_SCR) ETM System Configuration Register Offset */
#define ETM_TEEVR_REG_OFST             (0x20)         /**< (ETM_TEEVR) ETM TraceEnable Event Register Offset */
#define ETM_TECR1_REG_OFST             (0x24)         /**< (ETM_TECR1) ETM TraceEnable Control 1 Register Offset */
#define ETM_FFLR_REG_OFST              (0x28)         /**< (ETM_FFLR) ETM FIFO Full Level Register Offset */
#define ETM_CNTRLDVR1_REG_OFST         (0x140)        /**< (ETM_CNTRLDVR1) ETM Free-running Counter Reload Value Offset */
#define ETM_SYNCFR_REG_OFST            (0x1E0)        /**< (ETM_SYNCFR) ETM Synchronization Frequency Register Offset */
#define ETM_IDR_REG_OFST               (0x1E4)        /**< (ETM_IDR) ETM ID Register Offset */
#define ETM_CCER_REG_OFST              (0x1E8)        /**< (ETM_CCER) ETM Configuration Code Extension Register Offset */
#define ETM_TESSEICR_REG_OFST          (0x1F0)        /**< (ETM_TESSEICR) ETM TraceEnable Start/Stop EmbeddedICE Control Register Offset */
#define ETM_TSEVT_REG_OFST             (0x1F8)        /**< (ETM_TSEVT) ETM TimeStamp Event Register Offset */
#define ETM_TRACEIDR_REG_OFST          (0x200)        /**< (ETM_TRACEIDR) ETM CoreSight Trace ID Register Offset */
#define ETM_IDR2_REG_OFST              (0x208)        /**< (ETM_IDR2) ETM ID Register 2 Offset */
#define ETM_PDSR_REG_OFST              (0x314)        /**< (ETM_PDSR) ETM Device Power-Down Status Register Offset */
#define ETM_ITMISCIN_REG_OFST          (0xEE0)        /**< (ETM_ITMISCIN) ETM Integration Test Miscellaneous Inputs Offset */
#define ETM_ITTRIGOUT_REG_OFST         (0xEE8)        /**< (ETM_ITTRIGOUT) ETM Integration Test Trigger Out Offset */
#define ETM_ITATBCTR2_REG_OFST         (0xEF0)        /**< (ETM_ITATBCTR2) ETM Integration Test ATB Control 2 Offset */
#define ETM_ITATBCTR0_REG_OFST         (0xEF8)        /**< (ETM_ITATBCTR0) ETM Integration Test ATB Control 0 Offset */
#define ETM_ITCTRL_REG_OFST            (0xF00)        /**< (ETM_ITCTRL) ETM Integration Mode Control Register Offset */
#define ETM_CLAIMSET_REG_OFST          (0xFA0)        /**< (ETM_CLAIMSET) ETM Claim Tag Set Register Offset */
#define ETM_CLAIMCLR_REG_OFST          (0xFA4)        /**< (ETM_CLAIMCLR) ETM Claim Tag Clear Register Offset */
#define ETM_LAR_REG_OFST               (0xFB0)        /**< (ETM_LAR) ETM Lock Access Register Offset */
#define ETM_LSR_REG_OFST               (0xFB4)        /**< (ETM_LSR) ETM Lock Status Register Offset */
#define ETM_AUTHSTATUS_REG_OFST        (0xFB8)        /**< (ETM_AUTHSTATUS) ETM Authentication Status Register Offset */
#define ETM_DEVTYPE_REG_OFST           (0xFCC)        /**< (ETM_DEVTYPE) ETM CoreSight Device Type Register Offset */
#define ETM_PIDR4_REG_OFST             (0xFD0)        /**< (ETM_PIDR4) ETM Peripheral Identification Register #4 Offset */
#define ETM_PIDR5_REG_OFST             (0xFD4)        /**< (ETM_PIDR5) ETM Peripheral Identification Register #5 Offset */
#define ETM_PIDR6_REG_OFST             (0xFD8)        /**< (ETM_PIDR6) ETM Peripheral Identification Register #6 Offset */
#define ETM_PIDR7_REG_OFST             (0xFDC)        /**< (ETM_PIDR7) ETM Peripheral Identification Register #7 Offset */
#define ETM_PIDR0_REG_OFST             (0xFE0)        /**< (ETM_PIDR0) ETM Peripheral Identification Register #0 Offset */
#define ETM_PIDR1_REG_OFST             (0xFE4)        /**< (ETM_PIDR1) ETM Peripheral Identification Register #1 Offset */
#define ETM_PIDR2_REG_OFST             (0xFE8)        /**< (ETM_PIDR2) ETM Peripheral Identification Register #2 Offset */
#define ETM_PIDR3_REG_OFST             (0xFEC)        /**< (ETM_PIDR3) ETM Peripheral Identification Register #3 Offset */
#define ETM_CIDR0_REG_OFST             (0xFF0)        /**< (ETM_CIDR0) ETM Component  Identification Register #0 Offset */
#define ETM_CIDR1_REG_OFST             (0xFF4)        /**< (ETM_CIDR1) ETM Component  Identification Register #1 Offset */
#define ETM_CIDR2_REG_OFST             (0xFF8)        /**< (ETM_CIDR2) ETM Component  Identification Register #2 Offset */
#define ETM_CIDR3_REG_OFST             (0xFFC)        /**< (ETM_CIDR3) ETM Component  Identification Register #3 Offset */

