Microchip-MPLAB-Harmony/csp/apps/trng/random_number/firmware/src/packs/ATSAME54P20A_DFP/component/etm.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ETM register API structure */
typedef struct
{  /* Embedded Trace Macrocell */
  __IO  uint32_t                       ETM_CR;          /**< Offset: 0x00 (R/W  32) ETM Main Control Register */
  __I   uint32_t                       ETM_CCR;         /**< Offset: 0x04 (R/   32) ETM Configuration Code Register */
  __IO  uint32_t                       ETM_TRIGGER;     /**< Offset: 0x08 (R/W  32) ETM Trigger Event Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       ETM_SR;          /**< Offset: 0x10 (R/W  32) ETM Status Register */
  __I   uint32_t                       ETM_SCR;         /**< Offset: 0x14 (R/   32) ETM System Configuration Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  uint32_t                       ETM_TEEVR;       /**< Offset: 0x20 (R/W  32) ETM TraceEnable Event Register */
  __IO  uint32_t                       ETM_TECR1;       /**< Offset: 0x24 (R/W  32) ETM TraceEnable Control 1 Register */
  __IO  uint32_t                       ETM_FFLR;        /**< Offset: 0x28 (R/W  32) ETM FIFO Full Level Register */
  __I   uint8_t                        Reserved3[0x114];
  __IO  uint32_t                       ETM_CNTRLDVR1;   /**< Offset: 0x140 (R/W  32) ETM Free-running Counter Reload Value */
  __I   uint8_t                        Reserved4[0x9C];
  __I   uint32_t                       ETM_SYNCFR;      /**< Offset: 0x1E0 (R/   32) ETM Synchronization Frequency Register */
  __I   uint32_t                       ETM_IDR;         /**< Offset: 0x1E4 (R/   32) ETM ID Register */
  __I   uint32_t                       ETM_CCER;        /**< Offset: 0x1E8 (R/   32) ETM Configuration Code Extension Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       ETM_TESSEICR;    /**< Offset: 0x1F0 (R/W  32) ETM TraceEnable Start/Stop EmbeddedICE Control Register */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       ETM_TSEVT;       /**< Offset: 0x1F8 (R/W  32) ETM TimeStamp Event Register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       ETM_TRACEIDR;    /**< Offset: 0x200 (R/W  32) ETM CoreSight Trace ID Register */
  __I   uint8_t                        Reserved8[0x04];
  __I   uint32_t                       ETM_IDR2;        /**< Offset: 0x208 (R/   32) ETM ID Register 2 */
  __I   uint8_t                        Reserved9[0x108];
  __I   uint32_t                       ETM_PDSR;        /**< Offset: 0x314 (R/   32) ETM Device Power-Down Status Register */
  __I   uint8_t                        Reserved10[0xBC8];
  __I   uint32_t                       ETM_ITMISCIN;    /**< Offset: 0xEE0 (R/   32) ETM Integration Test Miscellaneous Inputs */
  __I   uint8_t                        Reserved11[0x04];
  __O   uint32_t                       ETM_ITTRIGOUT;   /**< Offset: 0xEE8 ( /W  32) ETM Integration Test Trigger Out */
  __I   uint8_t                        Reserved12[0x04];
  __I   uint32_t                       ETM_ITATBCTR2;   /**< Offset: 0xEF0 (R/   32) ETM Integration Test ATB Control 2 */
  __I   uint8_t                        Reserved13[0x04];
  __O   uint32_t                       ETM_ITATBCTR0;   /**< Offset: 0xEF8 ( /W  32) ETM Integration Test ATB Control 0 */
  __I   uint8_t                        Reserved14[0x04];
  __IO  uint32_t                       ETM_ITCTRL;      /**< Offset: 0xF00 (R/W  32) ETM Integration Mode Control Register */
  __I   uint8_t                        Reserved15[0x9C];
  __IO  uint32_t                       ETM_CLAIMSET;    /**< Offset: 0xFA0 (R/W  32) ETM Claim Tag Set Register */
  __IO  uint32_t                       ETM_CLAIMCLR;    /**< Offset: 0xFA4 (R/W  32) ETM Claim Tag Clear Register */
  __I   uint8_t                        Reserved16[0x08];
  __O   uint32_t                       ETM_LAR;         /**< Offset: 0xFB0 ( /W  32) ETM Lock Access Register */
  __I   uint32_t                       ETM_LSR;         /**< Offset: 0xFB4 (R/   32) ETM Lock Status Register */
  __I   uint32_t                       ETM_AUTHSTATUS;  /**< Offset: 0xFB8 (R/   32) ETM Authentication Status Register */
  __I   uint8_t                        Reserved17[0x10];
  __I   uint32_t                       ETM_DEVTYPE;     /**< Offset: 0xFCC (R/   32) ETM CoreSight Device Type Register */
  __I   uint32_t                       ETM_PIDR4;       /**< Offset: 0xFD0 (R/   32) ETM Peripheral Identification Register #4 */
  __I   uint32_t                       ETM_PIDR5;       /**< Offset: 0xFD4 (R/   32) ETM Peripheral Identification Register #5 */
  __I   uint32_t                       ETM_PIDR6;       /**< Offset: 0xFD8 (R/   32) ETM Peripheral Identification Register #6 */
  __I   uint32_t                       ETM_PIDR7;       /**< Offset: 0xFDC (R/   32) ETM Peripheral Identification Register #7 */
  __I   uint32_t                       ETM_PIDR0;       /**< Offset: 0xFE0 (R/   32) ETM Peripheral Identification Register #0 */
  __I   uint32_t                       ETM_PIDR1;       /**< Offset: 0xFE4 (R/   32) ETM Peripheral Identification Register #1 */
  __I   uint32_t                       ETM_PIDR2;       /**< Offset: 0xFE8 (R/   32) ETM Peripheral Identification Register #2 */
  __I   uint32_t                       ETM_PIDR3;       /**< Offset: 0xFEC (R/   32) ETM Peripheral Identification Register #3 */
  __I   uint32_t                       ETM_CIDR0;       /**< Offset: 0xFF0 (R/   32) ETM Component  Identification Register #0 */
  __I   uint32_t                       ETM_CIDR1;       /**< Offset: 0xFF4 (R/   32) ETM Component  Identification Register #1 */
  __I   uint32_t                       ETM_CIDR2;       /**< Offset: 0xFF8 (R/   32) ETM Component  Identification Register #2 */
  __I   uint32_t                       ETM_CIDR3;       /**< Offset: 0xFFC (R/   32) ETM Component  Identification Register #3 */
} etm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAME54_ETM_COMPONENT_H_ */
